MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB169/mcu.h
extern volatile __PWRCONbits_t PWRCONbits __asm__ ("PWRCON") __attribute__((section("sfrs"), address(0xBF801270)));
extern volatile uint32_t        PWRCONCLR __attribute__((section("sfrs"),address(0xBF801274)));
extern volatile uint32_t        PWRCONSET __attribute__((section("sfrs"),address(0xBF801278)));
extern volatile uint32_t        PWRCONINV __attribute__((section("sfrs"),address(0xBF80127C)));
#define REFO1CON REFO1CON
extern volatile uint32_t   REFO1CON __attribute__((section("sfrs"), address(0xBF801280)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO1CONbits_t;
extern volatile __REFO1CONbits_t REFO1CONbits __asm__ ("REFO1CON") __attribute__((section("sfrs"), address(0xBF801280)));
extern volatile uint32_t        REFO1CONCLR __attribute__((section("sfrs"),address(0xBF801284)));
extern volatile uint32_t        REFO1CONSET __attribute__((section("sfrs"),address(0xBF801288)));
extern volatile uint32_t        REFO1CONINV __attribute__((section("sfrs"),address(0xBF80128C)));
#define REFO1TRIM REFO1TRIM
extern volatile uint32_t   REFO1TRIM __attribute__((section("sfrs"), address(0xBF801290)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO1TRIMbits_t;
extern volatile __REFO1TRIMbits_t REFO1TRIMbits __asm__ ("REFO1TRIM") __attribute__((section("sfrs"), address(0xBF801290)));
extern volatile uint32_t        REFO1TRIMCLR __attribute__((section("sfrs"),address(0xBF801294)));
extern volatile uint32_t        REFO1TRIMSET __attribute__((section("sfrs"),address(0xBF801298)));
extern volatile uint32_t        REFO1TRIMINV __attribute__((section("sfrs"),address(0xBF80129C)));
#define REFO2CON REFO2CON
extern volatile uint32_t   REFO2CON __attribute__((section("sfrs"), address(0xBF8012A0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO2CONbits_t;
extern volatile __REFO2CONbits_t REFO2CONbits __asm__ ("REFO2CON") __attribute__((section("sfrs"), address(0xBF8012A0)));
extern volatile uint32_t        REFO2CONCLR __attribute__((section("sfrs"),address(0xBF8012A4)));
extern volatile uint32_t        REFO2CONSET __attribute__((section("sfrs"),address(0xBF8012A8)));
extern volatile uint32_t        REFO2CONINV __attribute__((section("sfrs"),address(0xBF8012AC)));
#define REFO2TRIM REFO2TRIM
extern volatile uint32_t   REFO2TRIM __attribute__((section("sfrs"), address(0xBF8012B0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO2TRIMbits_t;
extern volatile __REFO2TRIMbits_t REFO2TRIMbits __asm__ ("REFO2TRIM") __attribute__((section("sfrs"), address(0xBF8012B0)));
extern volatile uint32_t        REFO2TRIMCLR __attribute__((section("sfrs"),address(0xBF8012B4)));
extern volatile uint32_t        REFO2TRIMSET __attribute__((section("sfrs"),address(0xBF8012B8)));
extern volatile uint32_t        REFO2TRIMINV __attribute__((section("sfrs"),address(0xBF8012BC)));
#define REFO3CON REFO3CON
extern volatile uint32_t   REFO3CON __attribute__((section("sfrs"), address(0xBF8012C0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO3CONbits_t;
extern volatile __REFO3CONbits_t REFO3CONbits __asm__ ("REFO3CON") __attribute__((section("sfrs"), address(0xBF8012C0)));
extern volatile uint32_t        REFO3CONCLR __attribute__((section("sfrs"),address(0xBF8012C4)));
extern volatile uint32_t        REFO3CONSET __attribute__((section("sfrs"),address(0xBF8012C8)));
extern volatile uint32_t        REFO3CONINV __attribute__((section("sfrs"),address(0xBF8012CC)));
#define REFO3TRIM REFO3TRIM
extern volatile uint32_t   REFO3TRIM __attribute__((section("sfrs"), address(0xBF8012D0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO3TRIMbits_t;
extern volatile __REFO3TRIMbits_t REFO3TRIMbits __asm__ ("REFO3TRIM") __attribute__((section("sfrs"), address(0xBF8012D0)));
extern volatile uint32_t        REFO3TRIMCLR __attribute__((section("sfrs"),address(0xBF8012D4)));
extern volatile uint32_t        REFO3TRIMSET __attribute__((section("sfrs"),address(0xBF8012D8)));
extern volatile uint32_t        REFO3TRIMINV __attribute__((section("sfrs"),address(0xBF8012DC)));
#define REFO4CON REFO4CON
extern volatile uint32_t   REFO4CON __attribute__((section("sfrs"), address(0xBF8012E0)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO4CONbits_t;
extern volatile __REFO4CONbits_t REFO4CONbits __asm__ ("REFO4CON") __attribute__((section("sfrs"), address(0xBF8012E0)));
extern volatile uint32_t        REFO4CONCLR __attribute__((section("sfrs"),address(0xBF8012E4)));
extern volatile uint32_t        REFO4CONSET __attribute__((section("sfrs"),address(0xBF8012E8)));
extern volatile uint32_t        REFO4CONINV __attribute__((section("sfrs"),address(0xBF8012EC)));
#define REFO4TRIM REFO4TRIM
extern volatile uint32_t   REFO4TRIM __attribute__((section("sfrs"), address(0xBF8012F0)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO4TRIMbits_t;
extern volatile __REFO4TRIMbits_t REFO4TRIMbits __asm__ ("REFO4TRIM") __attribute__((section("sfrs"), address(0xBF8012F0)));
extern volatile uint32_t        REFO4TRIMCLR __attribute__((section("sfrs"),address(0xBF8012F4)));
extern volatile uint32_t        REFO4TRIMSET __attribute__((section("sfrs"),address(0xBF8012F8)));
extern volatile uint32_t        REFO4TRIMINV __attribute__((section("sfrs"),address(0xBF8012FC)));
#define REFO5CON REFO5CON
extern volatile uint32_t   REFO5CON __attribute__((section("sfrs"), address(0xBF801300)));
typedef struct {
  uint32_t ROSEL:4;
  uint32_t :4;
  uint32_t ACTIVE:1;
  uint32_t DIVSWEN:1;
  uint32_t :1;
  uint32_t RSLP:1;
  uint32_t OE:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t RODIV:15;
} __REFO5CONbits_t;
extern volatile __REFO5CONbits_t REFO5CONbits __asm__ ("REFO5CON") __attribute__((section("sfrs"), address(0xBF801300)));
extern volatile uint32_t        REFO5CONCLR __attribute__((section("sfrs"),address(0xBF801304)));
extern volatile uint32_t        REFO5CONSET __attribute__((section("sfrs"),address(0xBF801308)));
extern volatile uint32_t        REFO5CONINV __attribute__((section("sfrs"),address(0xBF80130C)));
#define REFO5TRIM REFO5TRIM
extern volatile uint32_t   REFO5TRIM __attribute__((section("sfrs"), address(0xBF801310)));
typedef struct {
  uint32_t :23;
  uint32_t ROTRIM:9;
} __REFO5TRIMbits_t;
