MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB169/mcu.h
extern volatile __GLCDCURLUT11bits_t GLCDCURLUT11bits __asm__ ("GLCDCURLUT11") __attribute__((section("sfrs"), address(0xBF8EAA2C)));
#define GLCDCURLUT12 GLCDCURLUT12
extern volatile uint32_t   GLCDCURLUT12 __attribute__((section("sfrs"), address(0xBF8EAA30)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT12bits_t;
extern volatile __GLCDCURLUT12bits_t GLCDCURLUT12bits __asm__ ("GLCDCURLUT12") __attribute__((section("sfrs"), address(0xBF8EAA30)));
#define GLCDCURLUT13 GLCDCURLUT13
extern volatile uint32_t   GLCDCURLUT13 __attribute__((section("sfrs"), address(0xBF8EAA34)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT13bits_t;
extern volatile __GLCDCURLUT13bits_t GLCDCURLUT13bits __asm__ ("GLCDCURLUT13") __attribute__((section("sfrs"), address(0xBF8EAA34)));
#define GLCDCURLUT14 GLCDCURLUT14
extern volatile uint32_t   GLCDCURLUT14 __attribute__((section("sfrs"), address(0xBF8EAA38)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT14bits_t;
extern volatile __GLCDCURLUT14bits_t GLCDCURLUT14bits __asm__ ("GLCDCURLUT14") __attribute__((section("sfrs"), address(0xBF8EAA38)));
#define GLCDCURLUT15 GLCDCURLUT15
extern volatile uint32_t   GLCDCURLUT15 __attribute__((section("sfrs"), address(0xBF8EAA3C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCURLUT15bits_t;
extern volatile __GLCDCURLUT15bits_t GLCDCURLUT15bits __asm__ ("GLCDCURLUT15") __attribute__((section("sfrs"), address(0xBF8EAA3C)));
#define GPUBASEADDR GPUBASEADDR
extern volatile uint32_t   GPUBASEADDR __attribute__((section("sfrs"), address(0xBF8EB000)));
#define SDHCBLKCON SDHCBLKCON
extern volatile uint32_t   SDHCBLKCON __attribute__((section("sfrs"), address(0xBF8EC004)));
typedef struct {
  uint32_t BSIZE:10;
  uint32_t :6;
  uint32_t BCOUNT:16;
} __SDHCBLKCONbits_t;
extern volatile __SDHCBLKCONbits_t SDHCBLKCONbits __asm__ ("SDHCBLKCON") __attribute__((section("sfrs"), address(0xBF8EC004)));
#define SDHCARG SDHCARG
extern volatile uint32_t   SDHCARG __attribute__((section("sfrs"), address(0xBF8EC008)));
typedef struct {
  uint32_t ARG:32;
} __SDHCARGbits_t;
extern volatile __SDHCARGbits_t SDHCARGbits __asm__ ("SDHCARG") __attribute__((section("sfrs"), address(0xBF8EC008)));
#define SDHCMODE SDHCMODE
extern volatile uint32_t   SDHCMODE __attribute__((section("sfrs"), address(0xBF8EC00C)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t BCEN:1;
  uint32_t ACEN:2;
  uint32_t DTXDSEL:1;
  uint32_t BSEL:1;
  uint32_t :10;
  uint32_t RESPTYPE:2;
  uint32_t :1;
  uint32_t CCRCCEN:1;
  uint32_t CIDXCEN:1;
  uint32_t DPSEL:1;
  uint32_t CTYPE:2;
  uint32_t CIDX:6;
} __SDHCMODEbits_t;
extern volatile __SDHCMODEbits_t SDHCMODEbits __asm__ ("SDHCMODE") __attribute__((section("sfrs"), address(0xBF8EC00C)));
#define SDHCRESP0 SDHCRESP0
extern volatile uint32_t   SDHCRESP0 __attribute__((section("sfrs"), address(0xBF8EC010)));
typedef struct {
  uint32_t RESP:32;
} __SDHCRESP0bits_t;
extern volatile __SDHCRESP0bits_t SDHCRESP0bits __asm__ ("SDHCRESP0") __attribute__((section("sfrs"), address(0xBF8EC010)));
#define SDHCRESP1 SDHCRESP1
extern volatile uint32_t   SDHCRESP1 __attribute__((section("sfrs"), address(0xBF8EC014)));
typedef struct {
  uint32_t RESP:32;
} __SDHCRESP1bits_t;
extern volatile __SDHCRESP1bits_t SDHCRESP1bits __asm__ ("SDHCRESP1") __attribute__((section("sfrs"), address(0xBF8EC014)));
#define SDHCRESP2 SDHCRESP2
extern volatile uint32_t   SDHCRESP2 __attribute__((section("sfrs"), address(0xBF8EC018)));
typedef struct {
  uint32_t RESP:32;
} __SDHCRESP2bits_t;
extern volatile __SDHCRESP2bits_t SDHCRESP2bits __asm__ ("SDHCRESP2") __attribute__((section("sfrs"), address(0xBF8EC018)));
#define SDHCRESP3 SDHCRESP3
extern volatile uint32_t   SDHCRESP3 __attribute__((section("sfrs"), address(0xBF8EC01C)));
typedef struct {
  uint32_t RESP:32;
} __SDHCRESP3bits_t;
extern volatile __SDHCRESP3bits_t SDHCRESP3bits __asm__ ("SDHCRESP3") __attribute__((section("sfrs"), address(0xBF8EC01C)));
#define SDHCDATA SDHCDATA
extern volatile uint32_t   SDHCDATA __attribute__((section("sfrs"), address(0xBF8EC020)));
typedef struct {
  uint32_t DATA:32;
} __SDHCDATAbits_t;
extern volatile __SDHCDATAbits_t SDHCDATAbits __asm__ ("SDHCDATA") __attribute__((section("sfrs"), address(0xBF8EC020)));
#define SDHCSTAT1 SDHCSTAT1
extern volatile uint32_t   SDHCSTAT1 __attribute__((section("sfrs"), address(0xBF8EC024)));
typedef struct {
  uint32_t CINHCMD:1;
  uint32_t CINHDAT:1;
  uint32_t DLACTIVE:1;
  uint32_t :5;
  uint32_t WRACTIVE:1;
  uint32_t RDACTIVE:1;
  uint32_t BWEN:1;
  uint32_t BREN:1;
  uint32_t :4;
  uint32_t CARDINS:1;
  uint32_t CARDST:1;
  uint32_t CDSLVL:1;
  uint32_t WPSLVL:1;
  uint32_t DATA0SLVL:1;
  uint32_t DATA1SLVL:1;
  uint32_t DATA2SLVL:1;
  uint32_t DATA3SLVL:1;
  uint32_t CMDSLVL:1;
} __SDHCSTAT1bits_t;
extern volatile __SDHCSTAT1bits_t SDHCSTAT1bits __asm__ ("SDHCSTAT1") __attribute__((section("sfrs"), address(0xBF8EC024)));
#define SDHCCON1 SDHCCON1
extern volatile uint32_t   SDHCCON1 __attribute__((section("sfrs"), address(0xBF8EC028)));
typedef struct {
  uint32_t :1;
  uint32_t DTXWIDTH:1;
  uint32_t HSEN:1;
  uint32_t DMASEL:2;
  uint32_t :1;
  uint32_t CDTLVL:1;
  uint32_t CDSSEL:1;
  uint32_t SDBP:1;
  uint32_t :7;
  uint32_t SBGREQ:1;
  uint32_t CONTREQ:1;
  uint32_t RDWTCON:1;
  uint32_t INTBG:1;
  uint32_t :4;
  uint32_t WKONINT:1;
  uint32_t WKONINS:1;
  uint32_t WKONREM:1;
} __SDHCCON1bits_t;
extern volatile __SDHCCON1bits_t SDHCCON1bits __asm__ ("SDHCCON1") __attribute__((section("sfrs"), address(0xBF8EC028)));
#define SDHCCON2 SDHCCON2
extern volatile uint32_t   SDHCCON2 __attribute__((section("sfrs"), address(0xBF8EC02C)));
typedef struct {
  uint32_t ICLKEN:1;
  uint32_t ICLKSTABLE:1;
  uint32_t SDCLKEN:1;
  uint32_t :5;
  uint32_t SDCLKDIV:8;
  uint32_t DTOC:4;
  uint32_t :4;
  uint32_t SWRALL:1;
  uint32_t SWRCMD:1;
  uint32_t SWRDATA:1;
} __SDHCCON2bits_t;
extern volatile __SDHCCON2bits_t SDHCCON2bits __asm__ ("SDHCCON2") __attribute__((section("sfrs"), address(0xBF8EC02C)));
#define SDHCINTSTAT SDHCINTSTAT
extern volatile uint32_t   SDHCINTSTAT __attribute__((section("sfrs"), address(0xBF8EC030)));
typedef struct {
  uint32_t CCIF:1;
  uint32_t TXCIF:1;
  uint32_t BGIF:1;
  uint32_t DMAIF:1;
  uint32_t BWRDYIF:1;
  uint32_t BRRDYIF:1;
  uint32_t CARDIIF:1;
  uint32_t CARDRIF:1;
  uint32_t CARDIF:1;
  uint32_t :6;
  uint32_t EIF:1;
  uint32_t CTOEIF:1;
  uint32_t CCRCEIF:1;
  uint32_t CEBEIF:1;
  uint32_t CIDXEIF:1;
  uint32_t DTOEIF:1;
  uint32_t DCRCEIF:1;
  uint32_t DEBEIF:1;
  uint32_t CLEIF:1;
  uint32_t ACEIF:1;
  uint32_t ADEIF:1;
} __SDHCINTSTATbits_t;
extern volatile __SDHCINTSTATbits_t SDHCINTSTATbits __asm__ ("SDHCINTSTAT") __attribute__((section("sfrs"), address(0xBF8EC030)));
#define SDHCINTEN SDHCINTEN
extern volatile uint32_t   SDHCINTEN __attribute__((section("sfrs"), address(0xBF8EC034)));
typedef struct {
  uint32_t CCIE:1;
  uint32_t TXCIE:1;
  uint32_t BGIE:1;
  uint32_t DMAIE:1;
  uint32_t BWRDYIE:1;
  uint32_t BRRDYIE:1;
  uint32_t CARDIIE:1;
  uint32_t CARDRIE:1;
  uint32_t CARDIE:1;
  uint32_t :6;
  uint32_t EIE:1;
  uint32_t CTOEIE:1;
  uint32_t CCRCEIE:1;
  uint32_t CEBEIE:1;
  uint32_t CIDXEIE:1;
  uint32_t DTOEIE:1;
  uint32_t DCRCEIE:1;
  uint32_t DEBEIE:1;
  uint32_t CLEIE:1;
  uint32_t ACEIE:1;
  uint32_t ADEIE:1;
} __SDHCINTENbits_t;
extern volatile __SDHCINTENbits_t SDHCINTENbits __asm__ ("SDHCINTEN") __attribute__((section("sfrs"), address(0xBF8EC034)));
#define SDHCINTSEN SDHCINTSEN
extern volatile uint32_t   SDHCINTSEN __attribute__((section("sfrs"), address(0xBF8EC038)));
typedef struct {
  uint32_t CCISE:1;
  uint32_t TXCISE:1;
  uint32_t BGISE:1;
  uint32_t DMAISE:1;
  uint32_t BWRDYISE:1;
  uint32_t BRRDYISE:1;
  uint32_t CARDIISE:1;
  uint32_t CARDRISE:1;
  uint32_t CARDISE:1;
  uint32_t :6;
  uint32_t EISE:1;
  uint32_t CTOEISE:1;
  uint32_t CCRCEISE:1;
  uint32_t CEBEISE:1;
  uint32_t CIDXEISE:1;
  uint32_t DTOEISE:1;
  uint32_t DCRCEISE:1;
  uint32_t DEBEISE:1;
  uint32_t CLEISE:1;
  uint32_t ACEISE:1;
  uint32_t ADEISE:1;
} __SDHCINTSENbits_t;
extern volatile __SDHCINTSENbits_t SDHCINTSENbits __asm__ ("SDHCINTSEN") __attribute__((section("sfrs"), address(0xBF8EC038)));
#define SDHCSTAT2 SDHCSTAT2
extern volatile uint32_t   SDHCSTAT2 __attribute__((section("sfrs"), address(0xBF8EC03C)));
typedef struct {
  uint32_t ACNEXEC:1;
  uint32_t ACTOE:1;
  uint32_t ACCRCE:1;
  uint32_t ACEBE:1;
  uint32_t ACIDXE:1;
  uint32_t :2;
  uint32_t CNISSE:1;
} __SDHCSTAT2bits_t;
extern volatile __SDHCSTAT2bits_t SDHCSTAT2bits __asm__ ("SDHCSTAT2") __attribute__((section("sfrs"), address(0xBF8EC03C)));
#define SDHCCAP SDHCCAP
extern volatile uint32_t   SDHCCAP __attribute__((section("sfrs"), address(0xBF8EC040)));
typedef struct {
  uint32_t TOCLKFREQ:6;
  uint32_t :1;
  uint32_t TOCLKU:1;
  uint32_t BASECLK:8;
  uint32_t :2;
  uint32_t MBLEN:2;
  uint32_t BUS8BIT:1;
  uint32_t ADMA2:1;
  uint32_t :1;
  uint32_t HISPEED:1;
  uint32_t :1;
  uint32_t SRESUME:1;
  uint32_t VOLT3V3:1;
  uint32_t :4;
  uint32_t ASYNCINT:1;
  uint32_t SLOTTYPE:2;
} __SDHCCAPbits_t;
extern volatile __SDHCCAPbits_t SDHCCAPbits __asm__ ("SDHCCAP") __attribute__((section("sfrs"), address(0xBF8EC040)));
#define SDHCMAXCAP SDHCMAXCAP
extern volatile uint32_t   SDHCMAXCAP __attribute__((section("sfrs"), address(0xBF8EC048)));
typedef struct {
  uint32_t MC3V3:8;
} __SDHCMAXCAPbits_t;
extern volatile __SDHCMAXCAPbits_t SDHCMAXCAPbits __asm__ ("SDHCMAXCAP") __attribute__((section("sfrs"), address(0xBF8EC048)));
#define SDHCFE SDHCFE
extern volatile uint32_t   SDHCFE __attribute__((section("sfrs"), address(0xBF8EC050)));
typedef struct {
  uint32_t FEACNEE:1;
  uint32_t FEACTOE:1;
  uint32_t FEACCRCE:1;
  uint32_t FEACEBE:1;
  uint32_t FEACIDXE:1;
  uint32_t :2;
  uint32_t FECNIACE:1;
  uint32_t :8;
  uint32_t FECTOE:1;
  uint32_t FECCRCE:1;
  uint32_t FECEBE:1;
  uint32_t FEIDXE:1;
  uint32_t FEDTOE:1;
  uint32_t FEDCRCE:1;
  uint32_t FEDEBE:1;
  uint32_t FECLE:1;
  uint32_t FEACE:1;
  uint32_t FEAE:1;
} __SDHCFEbits_t;
extern volatile __SDHCFEbits_t SDHCFEbits __asm__ ("SDHCFE") __attribute__((section("sfrs"), address(0xBF8EC050)));
#define SDHCAESTAT SDHCAESTAT
extern volatile uint32_t   SDHCAESTAT __attribute__((section("sfrs"), address(0xBF8EC054)));
typedef struct {
  uint32_t AERRST:2;
  uint32_t ALMERR:1;
} __SDHCAESTATbits_t;
extern volatile __SDHCAESTATbits_t SDHCAESTATbits __asm__ ("SDHCAESTAT") __attribute__((section("sfrs"), address(0xBF8EC054)));
#define SDHCAADDR SDHCAADDR
extern volatile uint32_t   SDHCAADDR __attribute__((section("sfrs"), address(0xBF8EC058)));
typedef struct {
  uint32_t ADDR:32;
} __SDHCAADDRbits_t;
extern volatile __SDHCAADDRbits_t SDHCAADDRbits __asm__ ("SDHCAADDR") __attribute__((section("sfrs"), address(0xBF8EC058)));
#define SBFLAG0 SBFLAG0
extern volatile uint32_t   SBFLAG0 __attribute__((section("sfrs"), address(0xBF8F0510)));
typedef struct {
  uint32_t T1PGV:1;
  uint32_t T4PGV:1;
  uint32_t T5PGV:1;
  uint32_t T2PGV:1;
  uint32_t T6PGV:1;
  uint32_t T0PGV0:1;
} __SBFLAG0bits_t;
extern volatile __SBFLAG0bits_t SBFLAG0bits __asm__ ("SBFLAG0") __attribute__((section("sfrs"), address(0xBF8F0510)));
#define SBT0ELOG1 SBT0ELOG1
extern volatile uint32_t   SBT0ELOG1 __attribute__((section("sfrs"), address(0xBF8F8020)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT0ELOG1bits_t;
extern volatile __SBT0ELOG1bits_t SBT0ELOG1bits __asm__ ("SBT0ELOG1") __attribute__((section("sfrs"), address(0xBF8F8020)));
#define SBT0ELOG2 SBT0ELOG2
extern volatile uint32_t   SBT0ELOG2 __attribute__((section("sfrs"), address(0xBF8F8024)));
typedef struct {
  uint32_t GROUP:2;
} __SBT0ELOG2bits_t;
extern volatile __SBT0ELOG2bits_t SBT0ELOG2bits __asm__ ("SBT0ELOG2") __attribute__((section("sfrs"), address(0xBF8F8024)));
#define SBT0ECON SBT0ECON
extern volatile uint32_t   SBT0ECON __attribute__((section("sfrs"), address(0xBF8F8028)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT0ECONbits_t;
