MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB169/mcu.h
#define _GLCDCLUT160_GREEN_POSITION              0x00000008
#define _GLCDCLUT160_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT160_GREEN_LENGTH                0x00000008

#define _GLCDCLUT160_RED_POSITION                0x00000010
#define _GLCDCLUT160_RED_MASK                    0x00FF0000
#define _GLCDCLUT160_RED_LENGTH                  0x00000008

#define _GLCDCLUT161_BLUE_POSITION               0x00000000
#define _GLCDCLUT161_BLUE_MASK                   0x000000FF
#define _GLCDCLUT161_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT161_GREEN_POSITION              0x00000008
#define _GLCDCLUT161_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT161_GREEN_LENGTH                0x00000008

#define _GLCDCLUT161_RED_POSITION                0x00000010
#define _GLCDCLUT161_RED_MASK                    0x00FF0000
#define _GLCDCLUT161_RED_LENGTH                  0x00000008

#define _GLCDCLUT162_BLUE_POSITION               0x00000000
#define _GLCDCLUT162_BLUE_MASK                   0x000000FF
#define _GLCDCLUT162_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT162_GREEN_POSITION              0x00000008
#define _GLCDCLUT162_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT162_GREEN_LENGTH                0x00000008

#define _GLCDCLUT162_RED_POSITION                0x00000010
#define _GLCDCLUT162_RED_MASK                    0x00FF0000
#define _GLCDCLUT162_RED_LENGTH                  0x00000008

#define _GLCDCLUT163_BLUE_POSITION               0x00000000
#define _GLCDCLUT163_BLUE_MASK                   0x000000FF
#define _GLCDCLUT163_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT163_GREEN_POSITION              0x00000008
#define _GLCDCLUT163_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT163_GREEN_LENGTH                0x00000008

#define _GLCDCLUT163_RED_POSITION                0x00000010
#define _GLCDCLUT163_RED_MASK                    0x00FF0000
#define _GLCDCLUT163_RED_LENGTH                  0x00000008

#define _GLCDCLUT164_BLUE_POSITION               0x00000000
#define _GLCDCLUT164_BLUE_MASK                   0x000000FF
#define _GLCDCLUT164_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT164_GREEN_POSITION              0x00000008
#define _GLCDCLUT164_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT164_GREEN_LENGTH                0x00000008

#define _GLCDCLUT164_RED_POSITION                0x00000010
#define _GLCDCLUT164_RED_MASK                    0x00FF0000
#define _GLCDCLUT164_RED_LENGTH                  0x00000008

#define _GLCDCLUT165_BLUE_POSITION               0x00000000
#define _GLCDCLUT165_BLUE_MASK                   0x000000FF
#define _GLCDCLUT165_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT165_GREEN_POSITION              0x00000008
#define _GLCDCLUT165_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT165_GREEN_LENGTH                0x00000008

#define _GLCDCLUT165_RED_POSITION                0x00000010
#define _GLCDCLUT165_RED_MASK                    0x00FF0000
#define _GLCDCLUT165_RED_LENGTH                  0x00000008

#define _GLCDCLUT166_BLUE_POSITION               0x00000000
#define _GLCDCLUT166_BLUE_MASK                   0x000000FF
#define _GLCDCLUT166_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT166_GREEN_POSITION              0x00000008
#define _GLCDCLUT166_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT166_GREEN_LENGTH                0x00000008

#define _GLCDCLUT166_RED_POSITION                0x00000010
#define _GLCDCLUT166_RED_MASK                    0x00FF0000
#define _GLCDCLUT166_RED_LENGTH                  0x00000008

#define _GLCDCLUT167_BLUE_POSITION               0x00000000
#define _GLCDCLUT167_BLUE_MASK                   0x000000FF
#define _GLCDCLUT167_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT167_GREEN_POSITION              0x00000008
#define _GLCDCLUT167_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT167_GREEN_LENGTH                0x00000008

#define _GLCDCLUT167_RED_POSITION                0x00000010
#define _GLCDCLUT167_RED_MASK                    0x00FF0000
#define _GLCDCLUT167_RED_LENGTH                  0x00000008

#define _GLCDCLUT168_BLUE_POSITION               0x00000000
#define _GLCDCLUT168_BLUE_MASK                   0x000000FF
#define _GLCDCLUT168_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT168_GREEN_POSITION              0x00000008
#define _GLCDCLUT168_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT168_GREEN_LENGTH                0x00000008

#define _GLCDCLUT168_RED_POSITION                0x00000010
#define _GLCDCLUT168_RED_MASK                    0x00FF0000
#define _GLCDCLUT168_RED_LENGTH                  0x00000008

#define _GLCDCLUT169_BLUE_POSITION               0x00000000
#define _GLCDCLUT169_BLUE_MASK                   0x000000FF
#define _GLCDCLUT169_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT169_GREEN_POSITION              0x00000008
#define _GLCDCLUT169_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT169_GREEN_LENGTH                0x00000008

#define _GLCDCLUT169_RED_POSITION                0x00000010
#define _GLCDCLUT169_RED_MASK                    0x00FF0000
#define _GLCDCLUT169_RED_LENGTH                  0x00000008

#define _GLCDCLUT170_BLUE_POSITION               0x00000000
#define _GLCDCLUT170_BLUE_MASK                   0x000000FF
#define _GLCDCLUT170_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT170_GREEN_POSITION              0x00000008
#define _GLCDCLUT170_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT170_GREEN_LENGTH                0x00000008

#define _GLCDCLUT170_RED_POSITION                0x00000010
#define _GLCDCLUT170_RED_MASK                    0x00FF0000
#define _GLCDCLUT170_RED_LENGTH                  0x00000008

#define _GLCDCLUT171_BLUE_POSITION               0x00000000
#define _GLCDCLUT171_BLUE_MASK                   0x000000FF
#define _GLCDCLUT171_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT171_GREEN_POSITION              0x00000008
#define _GLCDCLUT171_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT171_GREEN_LENGTH                0x00000008

#define _GLCDCLUT171_RED_POSITION                0x00000010
#define _GLCDCLUT171_RED_MASK                    0x00FF0000
#define _GLCDCLUT171_RED_LENGTH                  0x00000008

#define _GLCDCLUT172_BLUE_POSITION               0x00000000
#define _GLCDCLUT172_BLUE_MASK                   0x000000FF
#define _GLCDCLUT172_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT172_GREEN_POSITION              0x00000008
#define _GLCDCLUT172_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT172_GREEN_LENGTH                0x00000008

#define _GLCDCLUT172_RED_POSITION                0x00000010
#define _GLCDCLUT172_RED_MASK                    0x00FF0000
#define _GLCDCLUT172_RED_LENGTH                  0x00000008

